src/main/resources/xml/accommodationFulfillmentServicePort/trackCastAction/trackCastAction.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:trackCastAction>
         <request>
            <businessEntitySource>?</businessEntitySource>
            <businessEntityType>?</businessEntityType>
            <businessEntityValue>?</businessEntityValue>
            <userAction>?</userAction>
            <userActionTime>?</userActionTime>
            <locationId>?</locationId>
            <clientPCName>?</clientPCName>
            <appName>?</appName>
            <clientIPAddress>?</clientIPAddress>
            <userActionDesc>?</userActionDesc>
            <userRole>?</userRole>
            <userActionImpact>?</userActionImpact>
            <userLocation>?</userLocation>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:trackCastAction>
   </soapenv:Body>
</soapenv:Envelope>
